// Напишите программу, которая будет выдавать название дня неделю по заданному номеру.
// 3-> среда
// 5-> пятница
// ввести данные
// спросить
// вывести

Console.Write("Введите число от 1 до 7");
int number1 = int.Parse(Console.ReadLine());

if (number1== 1)
{
    Console.WriteLine("Понедельник")
}

else
Console.WriteLine("Сказано же, введите число от 1 до 7")

